import 'package:ailence/main/component/page_header.dart';
import 'package:flutter/material.dart';
import '../component/main_widget.dart';
import '../utils/app_vars.dart';

class FAQ extends StatelessWidget {
  const FAQ({super.key});

  @override
  Widget build(BuildContext context) {
    return MainWidget(
      page: Column(
        children: [
          const PageHeader(title: 'الأسئلة الشائعة', desc: 'أهم الأسئلة عن الموقع وخصائصه وميزاته', icon: Icons.contact_support),
          ...content.map((el) => FaqPart(content: el)),
        ],
      ),
    );
  }
}

class FaqPart extends StatelessWidget {
  final Map<String, List<Map<String, String>>> content;
  const FaqPart({super.key, required this.content});

  @override
  Widget build(BuildContext context) {
    return Container(
      width: double.infinity,
      margin: const EdgeInsets.only(top: 20),
      padding: const EdgeInsets.all(20),
      decoration: BoxDecoration(
        color: componentBackground,
        borderRadius: BorderRadius.circular(30),
      ),
      child: Column(
        crossAxisAlignment: CrossAxisAlignment.start,
        children: [
          Padding(
            padding: const EdgeInsets.only(top: 5),
            child: Text(content.keys.first, style: const TextStyle(fontWeight: FontWeight.bold, fontSize: 20)),
          ),
          ...content[content.keys.first]!.map(
            (el) => Padding(
              padding: const EdgeInsets.only(top: 15),
              child: Column(
                spacing: 3,
                crossAxisAlignment: CrossAxisAlignment.start,
                children: [
                  Text(el['q']!, style: const TextStyle(fontWeight: FontWeight.bold)),
                  Text(el['a']!),
                ],
              ),
            ),
          )
        ],
      ),
    );
  }
}

List<Map<String, List<Map<String, String>>>> content = [
  // general info
  {
    'معلومات عامة': [
      {
        'q': 'ما هي منصة آيلنس ؟',
        'a':
            'منصة آيلنس هي منصة تعليمية مدعومة بالذكاء الاصطناعي، تقدّم المناهج الرسمية من المرحلة الابتدائية إلى الجامعية. بالإضافة إلى ذلك، تمكّن المنصة الطلاب من تحقيق دخل عبر المشاركة في إنتاج وتحسين المحتوى التعليمي مثل كتابة الدروس وإضافة الأسئلة',
      },
      {
        'q': 'بماذا تتميز منصة آيلنس ؟',
        'a':
            'تتميز بإستراتيجيات ذكية للتعلّم والمراجعة، مجتمع طلابي نشط، مسابقات تعليمية بجوائز مالية، وفرصة للعمل على إنشاء المحتوى التعليمي وتحقيق دخل إضافي.',
      },
      {
        'q': 'ما هي الدول التي تستهدفها المنصة ؟',
        'a': 'المنصة متاحة حالياً في جمهورية مصر العربية فقط.',
      },
      {
        'q': 'هل هناك إصدارات مستقبلية لدول أخرى ؟',
        'a': 'تخطط المنصة للتوسّع لاحقًا، لكن حاليًا لا يوجد تاريخ محدد لدول أخرى.',
      },
      {
        'q': 'هل المنصة تدرس المناهج المعتمدة في المدارس والجامعات أم دورات تعليمية مختلفة ؟',
        'a': 'تركّز المنصة حالياً على المناهج المعتمدة في المدارس الحكومية والجامعات المصرية، مع إمكانية إضافة دورات دعم وتقوية لبعض المواد مستقبلاً.',
      },
      {
        'q': 'ماذا أفعل عند وجود مشكلة ؟',
        'a': 'يمكنك التواصل مع فريق الدعم، وسيتم الرد عليك في أقرب وقت ممكن.',
      },
    ],
  },

  // study info
  {
    'منصة آيلنس للتعليم': [
      {
        'q': 'ما هو "العرض الذكي"؟',
        'a':
            'العرض الذكي هو أسلوب تعليمي تفاعلي يقدّم الدروس على مراحل، ويتأكد من استيعاب الطالب عبر اختبارات قصيرة بعد كل فقرة. لا يسمح بالانتقال إلى الفقرة التالية إلا بعد الإجابة الصحيحة. وفي حال الخطأ، يُعاد شرح الفقرة بشكل أكثر تفصيلاً ثمَّ إعادة الاختبار، لضمان فهم أعمق للمحتوى التعليمي.',
      },
      {
        'q': 'ما هي ميزات العرض الذكي ؟',
        'a':
            "يوفِّر 'العرض الذكي' بيئة تعلم تضمن الفهم الكامل لكل فقرة قبل الانتقال إلى الفقرة اللاحقة، إذ لا يُسمح بالاستمرار ما لم يجب الطالب بشكل صحيح على جميع الأسئلة المرفقة."
      },
      {
        'q': 'ما هي "المراجعة الذكية"؟',
        'a':
            'هي مراجعات دورية للأسئلة بحسب مستوى حفظ الطالب. حيث تقوم بتقييم استيعاب الطالب عبر اختبارات دورية. فعلى سبيل المثال، بعد إتمام الطالب لحفظ عدة فقرات، يخضع لاختبار لتقييم حفظه؛ فإذا أتقن الإجابة تُراجع لاحقًا بعد فترة أطول، وإذا لم يتقنها جيدًا، تُراجع بعد فترة قصيرة وبهذا النهج، يتم التركيز على الفقرات التي تحتاج إلى تعزيز حفظ دون إهدار الجهد في مراجعة الملعومات المتقنة.',
      },
      {
        'q': 'ما هي ميزات المراجعة الذكية ؟',
        'a':
            'تتميز المراجعة الذكية بأنها تركز على تعزيز المعلومات ذات الحفظ الضعيف فقط؛ فهي يراجع باستمرار المعلومات الموجودة في ذاكرته قصيرة المدى بهدف تقوية حفظها مما يؤدي إلى نقلها للذاكرة طويلة المدى بطريقة منظمة وسلسة. كما أنها تريح الطالب من جهد هائل، إذ يكتفي بمراجعة المواضيع التي تتطلب تحسيناً في الحفظ، دون مراجعة كامل المادة.',
      },
      {'q': 'ما هو المجتمع الطلابي ؟', 'a': 'مصنة تواصل اجتماعي تفاعلي بين الطلاب من مختلف المدارس والمناطق للتواصل، وطرح الأسئلة، وتبادل المعلومات.'},
      {
        'q': 'ما هي المسابقات الطلابية ؟',
        'a':
            'تنظم المنصة بين كل حينة وأخرى مسابقات متعددة المجالات، مثل الرياضيات، الفيزياء، والعلوم، وغيرها الطلاب الأسرع والأدق في الإجابة يتم مكافأتهم بجوائز نقدية',
      },
    ],
  },

  // work info
  {
    'منصة آيلنس للعمل': [
      {
        'q': 'ما هي خطة تطوير المنصة ؟',
        'a':
            "تتضمن خطة التطوير عدة مراحل لضمان جودة التعليم. تبدأ المرحلة الأولى بإضافة المناهج الدراسية، وفي المرحلة الثانية يتم ربط المناهج بعضها ببعض لتأسيس أساس متين لكل مادة. تلي ذلك المرحلة الثالثة المتضمنة تدريب نظام ذكاء اصطناعي على محتوى المنصة، مما يسهم في تقديم تجربة محسنة للطلاب. وهناك مراحل إضافية سيتم الإعلان عنها لاحقاً."
      },
      {
        'q': 'ما الأسباب التي تدفعكم لنعمل على المنصة؟',
        'a':
            'نجن نسعى إلى تدريب نماذج الذكاء الاصطناعي على المناهج الدراسية. ولتحقيق ذلك، يجب أولاً جمع المناهج الدراسية بشكل كامل وربط الفقرات المختلفة ببعضها لضمان تدريب نموذج الذكاء الاصطناعي الخاص بنا بشكل صحيح وفعّال.',
      },
      {
        'q': 'كيف أبدأ العمل على المنصة ؟',
        'a': 'أنشئ حساباً، ثم ادخل إلى منصة العمل ثم قم بتنفيذ المهام التدريبية. وبعدها ستصبح المهام الفعلية متاحة لك.',
      },
      {
        'q': 'ما هي صفتي عند العمل في المنصة ؟',
        'a': 'عندما تساهم في المحتوى التعليمي ستعتبر شريكًا مع إدارة المنصة، ومالكاً شرعياً لحصتك في الأرباح التي تحققها المنصة.',
      },
      {
        'q': 'ما هي أنواع المهمات في المنصة ؟',
        'a':
            'تتنوع المهمات المتوفرة على المنصة مثل كتابة فهارس لمواد دراسية محددة، إضافة أسئلة اختيار من متعدد، إضافة التسجيلات الصوتية إلى النصوص، كتابة المحتوى التعليمي، التأكد من جودة الدرس وغيرها من المهام المتنوعة.',
      },
      {
        'q': 'هل أنا ملزم بمادة معينة أو بمهمة معينة لتنفيذها ؟',
        'a': 'أنت حر في اختيار أي مهمة تفضل القيام بها، والمادة التي تود المساهمة فيها.',
      },
      {
        'q': 'ما هي نقاط المصداقية ؟',
        'a':
            'نقاط المصداقية تحدد مدى أهليتك لتنفيذ المهام وتحافظ على توزيع عادل للفرص بين جميع المستخدمين. وهي تتراوح ما بين 0 و100 نقطة، وتبدأ برصيد 60 نقطة عند إنشاء الحساب. ترتفع هذه النقاط عند إنجاز المهام بنجاح وتنخفض عند رفضها. وفي حالة الوصول إلى 0 نقطة يحرمك هذا من إمكانية تنفيذ المهام.',
      },
      {
        'q': 'ماذا يحصل عند إتمام المهمة؟',
        'a':
            'عند إكمال مهمتك، يُضاف وقت تنفيذها إلى رصيد العمل المعلق في حسابك. بعدها تُنشأ تلقائياً مهمة جديدة (لا تظهر لك) تهدف إلى تقييم جودة عملك من قِبَل مستخدمين آخرين. في حال موافقتهم على مهمتك، يُنقل الوقت من الرصيد المعلق إلى رصيد ساعات العمل. يُرجى ملاحظة أنه يتم خصم نقطتي مصداقية مؤقتاً ريثما تتم عملية التحقق وفي حال قبول المهمة تُعاد إليك هاتان النقطتان مع نقطة إضافية تقديراً لجودة أدائك. أما في حال الرفض، فتُخصم النقطتان نهائياً.',
      },
      {
        'q': 'لماذا تنقص نقاط المصداقية عند تنفيذ مهمة ؟',
        'a':
            'يتم خصم نقطتي مصداقية بشكل مؤقت عند البدء في أي مهمة لضمان توزيع عادل للمهام بين جميع المستخدمين وللحد من استحواذ البعض على أكبر عدد من المهام. كما يشجّع هذا النظام على تحسين جودة العمل، ويُساهم في كشف الغش والاحتيال بسرعة.',
      },
      {
        'q': 'ماذا يحدث إذا كانت آراء المراجعين للمهمة منقسمة حول قبول أو رفض المهمة؟',
        'a':
            'يُحدّد عدد المراجعين بأرقام فردية (مثل ثلاثة أو خمسة أو سبعة) لضمان أغلبية واضحة. يُتخذ القرار بناء على الرأي الغالب، بشرط ألا يقل عدد الأصوات المؤيدة عن ثلاثة.',
      },
      {
        'q': 'ماذا أكسب عند تنفيذ المهمة بشكل صحيح ؟',
        'a':
            'عند إتمام المهمة بنجاح، يُنقل الوقت الذي استغرقته من رصيد العمل المعلق إلى رصيد ساعات العمل، مما يمكّنك من الحصول على نصيبك من الأرباح لاحقاً. يمكنك أيضاً بيع حقوق ساعات العمل مباشرةً مقابل المال. بالإضافة إلى ذلك، تُعاد لك نقطة المصداقية التي خُصمت عند بدء المهمة ويُضاف نقطة إضافية مكافأةً لجودة أدائك.',
      },
      {
        'q': 'ماذا يحصل إن تم رفض المهمة ؟',
        'a':
            'في حال رفض أحد المراجعين مهمة قمت بتنفيذها، يتوجب حينها على المراجع أن يصحح الأخطاء وبعد تنفيذه للمهمة ثم قبول مراجعين آخرين تعديلاته سيحسب حينها كمية التعديلات وسيقسم الوقت بين منفذ المهمة الأصلي والمعدل، فمثلاً إذا كانت التعديلات بنسبة 30% سيقسم وقت المهمة الأصلي بين 70% لمنفذ المهمة و30% للمعدل، كما أنه ستخسر نقطة واحدة إذا كانت نسبة التعديلات فوق 90% وستخسر النقطتين في حلة كانت التعديلات أقل من ذلك',
      },
      {
        'q': 'هل يمكنني كسب الأرباح من الساعات المعلقة أو المرفوضة؟',
        'a': 'لا، الأرباح تقتصر على الساعات المقبولة فقط. الساعات المعلقة والمرفوضة لا تُحتسب في إجمالي ساعات العمل المؤهلة للأرباح أو للبيع.',
      },
      {
        'q': 'هل أنا ملزم بوقت محدد لتنفيذ المهمة ؟',
        'a': 'نعم، فلكل مهمة وقت محدد يكفي لإتمامها بشكل صحيح، وعادةً ما يوضع لكل مهمة مدة تزيد بمقدار النصف عن الوقت الذي يُتوقع أن تستغرقه.',
      },
      {
        'q': 'ما هي مدة المهمة ؟',
        'a': 'مدة المهمة هو الوقت المقدر من قبل إدارة مسبقاً لتنفيذ المهمة وهو الوقت الذي يضاف لرصيدك بعد تنفيذ المهمة',
      },
      {
        'q': 'لماذا يُحدد وقت معين للمهمة مسبقاً بدلاً من حساب الوقت من لحظة قبول المهمة إلى تسليمها؟',
        'a':
            "تحديد مدة مسبقة للمهمة يضمن عدالة توزيع الأرباح ومنع التلاعب بالوقت. فبدلاً من حساب مدة تنفيذ المهمة بشكل فردي لكل مستخدم بدءاً من قبوله المهمة وحتى تلسليمها مما قد يظلم المستخدمين الأسرع والأكفأ يتم اعتماد مدة قياسية مُضافة إليها فترة احتياطية مراعاة لفروق الأداء. بهذا الأسلوب، يحصل الجميع على فرصة متكافئة، كما أنه يمنع إمكانية التباطؤ المتعمد لإطالة زمن المهمة."
      },
      {
        'q': 'ماذا يحصل إن أكملت المهمة قبل نهاية وقت المهمة ؟',
        'a':
            'إن كان الوقت المحدد للمهمة هو ربع ساعة، وقمت بإكمال المهمة خلال عشر دقائق .. فإنه سيضاف لرصيدك ربع ساعة وليس عشر دقائق نحن عادة ما نيضف وقت احتياطي مراعاة للكفاءات الأقل',
      },
      {
        'q': 'استغرقت عشر دقائق في إنجاز مهمة مدتها نصف ساعة فما سبب كل هذا الوقت الإضافي ؟',
        'a': 'إن بعض المواد تختلف في أهميتها عن المواد الأخرى فالمواد ذات الأهمية البالغة يضاف لها وقت إضافي (على قدر أهميتها) كحوافز على تنفيذ المهمة',
      },
      {
        'q': 'ما هي مدة حجز المهمة ؟',
        'a':
            'عند اختيارك لمهمة ما ستكون هذه المهمة محجوزة لك خلال مدة معينة وهي ثلاثة أضعاف وقت المهمة فمثلاً إذا كان الوقت المحدد للمهمة عشر دقائق، فإن مدة الحجز ستكون ثلاثين دقيقة تبدأ من لحظة قبولك للمهمة. ويجب عليك إتمام المهمة خلال هذه الفترة وإذا تجاوزت هذه المدة، فستعتبر المهمة مرفوضة وستعود إلى قائمة المهام المتاحة للجميع مرة أخرى',
      },
      {
        'q': 'إذا استغرقت نصف ساعة لإتمام مهمة مدتها ربع ساعة، هل يُأخذ الوقت الإضافي في الاعتبار؟',
        'a':
            'الوقت الذي يتجاوز مدة المهمة يكون نتيجة لعدم فهم المادة المطلوبة فالأصل أن يكون منفذ المهمة على اطلاع كبير بالمادة الدراسية وغير ذلك قد يتطلب وقتاً إضافياً لضمان جودة العمل. عموماً لا تأخذ الإدارة هذا الوقت الإضافي في الاعتبار. ومع ذلك، إذا كنت متخصصاً في المادة وتعتقد أن الوقت المحدد غير كافٍ، يمكنك التواصل مع الإدارة من خلال الدعم لطلب تمديد وقت المهمة مع العلم أن قرار تمديد المهمة يبقى بيد الإدارة. نسعى دومًا للعدالة ونحرص على منع أي تلاعب أو تمديد غير مبرر في وقت العمل',
      },
      {
        'q': 'ماذا يحصل بعد انتهاء مدة حجز المهمة ؟',
        'a': 'عند تجاوز المدة الإضافية ستتوقف المهمة وستعتبر المهمة مرفوضة وستصبح متاحة للجميع وليست محجوزة لك فقط وكذلك ستنقص نقاط المصداقية المعلقة لديك',
      },
      {
        'q': 'إذا اخترت مهمة ثم قررت التوقف عنها واختيار أخرى، ماذا أفعل؟',
        'a':
            'قبل الالتزام بمهمة معينة، من الضروري أن تقيم قدرتك على إكمالها. اختيارك للمهمة يفترض أنك قادر على تنفيذها. إذا تراجعت عن تنفيذ المهمة بعد البدء بها، ستُعتبر المهمة مرفوضة وسينقص حينها نقاط مصداقيتك، فيجب عليك قبل اختيارك مهمة ما التأكد من قدرتك على تنفيذها.',
      },
      {
        'q': 'انخفضت نقاط مصداقيتي إلى 0 نقطة فما الحل ؟',
        'a':
            'يمكنك زيادة نقاط مصداقيتك عن طريق شراء 10 نقاط بقيمة 100 جنيه. وسيصبح رصيدك عندها 10 نقاط والمبلغ المدفوع سيُعتبر كإيراد، وسيتم توزيعه على جميع المستخدمين كتعويض عن الوقت المستغرق في التحقق من المهام الفاشلة. مع العلم أنه لا يمكنك شراء أكثر من 10 نقاط',
      },
      {
        'q': 'لا تظهر لي أي مهمة فما السبب ؟',
        'a':
            'ذلك قد يعود لسببين: إما أنه لا توجد مهام متاحة حاليًا، أو أنه لا يوجد نقاط المصداقية. ننصح بأن تحافظ على رصيد نقاط المصداقية عالية لضمان ظهور مجموعة متنوعة من المهام لك.',
      },
      {
        'q': 'ماذا يعني الحصص الملغاة ؟',
        'a':
            'في حال حذف مادة أو درس من المنهاج الدراسي أو استبدالهما بمحتوى جديد، تُلغى جميع الساعات المرتبطة بالمحتوى القديم. هذا يعني شطب تلك الساعات من السجل الإجمالي للساعات، وإضافة مهام جديدة لإثراء المحتوى المحدث.',
      },
      {
        'q': 'لماذا نقصت حصتي من رصيد العمل فجأة ؟',
        'a':
            'قد يحدث ذلك نتيجة إلغاء المحتوى التعليمي الذي عملت عليه واستبداله بمحتوى جديد. تُحذف ساعات العمل المرتبطة بذلك المحتوى من السجل الإجمالي، بما في ذلك حصتك وحصة إدارة المنصة، دون تعويض.',
      },
      {
        'q': 'هل يتم تعويض رصيد ساعات العمل الملغاة؟',
        'a':
            'للأسف، لا يتم تقديم تعويض عن المهام الملغاة لأن ذلك يحدث لأسباب خارجة عن إرادة المنصة. ينطبق هذا الأمر على جميع المستخدمين والإدارة على حدّ سواء.',
      },
    ],
  },

  // profit info
  {
    'منصة آيلنس للربح': [
      {
        'q': 'كيف أكسب المال من المنصة ؟',
        'a':
            'يمكنك الربح من المنصة عبر طريقتين: الاستثمار المالي أو بذل الجهد في تنفيذ المهام أو كلاهما. فيمكنك شراء ساعات عمل معروضة للبيع أو تنفيذ مهام مختلفة متاحة على المنصة. وبعد كل مهمة يضاف مدة العمل إلى رصيدك. وعند تحقيق المنصة لأرباح، يتم توزيع هذه الأرباح بناءً على إجمالي ساعات العمل المسجلة في المنصة، وستحصل على حصتك من الأرباح استناداً إلى مدة عملك.',
      },
      {
        'q': 'ما هي حصة إدارة المنصة من الأرباح ؟',
        'a':
            'حصة إدارة المنصة من الأرباح تبلغ 50% من إجمالي الساعات المسجلة. تستخدم الإدارة هذه الأموال لتغطية نفقات السيرفرات، الموظفين، الحملات التسويقية، تمويل المسابقات الطلابية، وغيرها من التكاليف الإدارية.',
      },
      {
        'q': 'كيف يتم توزيع حصة إدارة المنصة من المهام ؟',
        'a':
            'عند تنفيذك لمهمة ما وتم التحقق من تنفيذها بشكل صحيح سيتم إضافة وقت المهمة إلى السجل الإجمالي لساعات العمل على المنصة باسمك الخاص وبذات الوقت يضاف أيضاً نفس الوقت لنفس المهمة ولكن لصالح إدارة المنصة، أي أن وقت المهمة يضاف مرتين، مرة لصالحك ومرة لصالح الإدارة.',
      },
      {
        'q': 'إذا قمت بتنفيذ مهام لمادة معينة في سنة معينة هل أكسب الأرباح على مواد أخرى  لسنين أخرى ؟',
        'a': 'إن الأرباح المحصلة من اشتراك الطلاب لأي مادة توزع على جميع المهام في المنصة على اختلاف المناهج، فأي دخل يدخل للمنصة يوزع على كل أصحاب المهام',
      },
      {
        'q': 'كيف تقسم الأرباح بناءً على حصتي ؟',
        'a':
            'لنفترض أن لديك عشر ساعات عمل في حسابك، والمجموع الكلي لساعات العمل في المنصة هو ألف ساعة. وبالتالي حصتك ستكون 1% من العمل الكلي. فإذا اشترك أحد الطلاب بقيمة ألف جنيه، فستتوزع هذه القيمة بناءً على كل الساعات وبالنتيجة يكون نصيبك منها عشر جنيهات. أو بالأحرى 1% من كل إيراد مالي للمنصة',
      },
      {
        'q': 'إذا قامت الإدارة بإنشاء حسم على سعر المواد التعليمية، فهل سيؤثر هذا الحسم على أرباحي؟',
        'a':
            'جميع العروض والتخفيضات على أسعار المواد التعليمية تقع تحت مسؤولية إدارة المنصة ولا تُخصم من أرباح الشركاء. على سبيل المثال، إذا كان السعر لمادة ما ألف جنيه وتم تطبيق خصم 100 جنيه، فإن الطالب سيدفع تسع مئة جنيه، وتقوم إدارة المنصة بتعويض مقدار الخصم للشركاء.'
      },
      {
        'q': 'كيف أضمن توزيع الأرباح بشكل عادل ؟',
        'a': 'يوجد سجل علني لأرباح المنصة يُحدث فورياً عند أي دخل جديد، ويمكنك مراجعته في أي وقت وفي حال كنت تملك ولو حصة صغيرة ستجد نصيبك من الدخل الجديد',
      },
      {
        'q': 'كيف أتأكد من تسجيل كل الإيرادات في صفحة توزيعات الأرباح؟',
        'a': 'يمكنك تجربة الاشتراك في أي خدمة على المنصة، وستلاحظ إضافة قيمتها فوراً إلى صفحة توزيعات الأرباح.',
      },
      {
        'q': 'ما هو الحد الأدنى لسحب الأرباح ؟',
        'a': 'يمكنك طلب سحب أرباحك فور تجاوزها الحد الأدنى المحدد، وهو 100 جنيه.',
      },
      {
        'q': 'ماذا يعني "بيع ساعات العمل"؟',
        'a': 'إذا رغبت في الحصول على مال فوري بدلاً من الانتظار حتى توزيع الأرباح، يمكنك بيع حقوق ساعات العمل المسجلة في حسابك بالسعر الذي تحدده أنت.',
      },
      {
        'q': 'ماذا يعني "شراء ساعات العمل"؟',
        'a':
            'إذا كنت تفضل الاستثمار بدلاً من تنفيذ المهام بنفسك، يمكنك شراء ساعات العمل المعروضة للبيع. ستمتلك حقوق ملكيتها وتحصل على حصتك من الأرباح عند تحقيق المنصة لأي عوائد مستقبلية.',
      },
      {
        'q': 'هل يمكنني شراء ساعات عمل جديدة تلقائياً؟',
        'a':
            'نعم. يمكنك تفعيل خيار الشراء التلقائي في صفحة توزيع الأرباح، بحيث يوجّه جزء من إيراداتك في الأرباح إلى رصيد شراء ساعات عمل جديدة. يمكنك أيضاً تحويل هذا الرصيد إلى رصيدك العادي في أي وقت.',
      },
      {
        'q': 'كيف أسحب المال من المنصة؟',
        'a': 'يمكنك تقديم طلب سحب عندما تتجاوز أرباحك الحد الأدنى. تقوم الإدارة بمعالجة الطلب خلال فترة تتراوح بين عدة ساعات وحتى سبعة أيام كحد أقصى.',
      },
      {
        'q': 'هل يوجد أية رسوم على سحب الأرباح؟',
        'a': 'لا تفرض المنصة أي رسوم على السحب. ولكن قد تنطبق رسوم خارجية صادرة عن شركات الدفع الوسيطة مثل فودافون كاش أو فوري.',
      },
    ],
  }
];
